config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Your Name
#+STARTUP: indent
;;; 这是Emacs的主要配置文件，使用org-mode格式编写
;;; 配置通过org-babel在保存时自动tangle到init.el

* Basic Settings
;;; 基础设置部分包含窗口管理、界面元素、编码和备份等基本配置
** Window Maximization
;;; 设置Emacs窗口启动时最大化显示
#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

** Disable Startup Screen
;;; 禁用Emacs启动时的欢迎界面
#+begin_src emacs-lisp
(setq inhibit-startup-message t)
#+end_src

** Disable UI Elements
;;; 禁用工具栏、菜单栏和滚动条，提供更简洁的编辑界面
#+begin_src emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Encoding Settings
;;; 设置UTF-8为默认编码系统，确保多语言支持
#+begin_src emacs-lisp
(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
#+end_src

** Backup Settings
;;; 配置备份文件存放位置，避免污染工作目录
#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+end_src

** Load Path Configuration
;;; 将site-lisp目录及其子目录添加到load-path，方便加载第三方库
#+begin_src emacs-lisp
(let ((default-directory "~/.emacs.d/site-lisp/"))
  (normal-top-level-add-subdirs-to-load-path))
#+end_src

* Package Management
;;; 包管理部分配置use-package来管理Emacs插件
** use-package Configuration
;;; 配置use-package，这是Emacs的声明式包管理工具
#+begin_src emacs-lisp
(require 'use-package)
(setq use-package-always-ensure nil)
(add-to-list 'load-path "~/.emacs.d/site-lisp/use-package")
(require 'use-package)

(with-eval-after-load 'info
  (info-initialize)
  (add-to-list 'Info-directory-list
               "~/.emacs.d/site-lisp/use-package/"))
#+end_src

* Completion Framework
;;; 补全框架部分配置现代化补全系统，包括Vertico、Consult、Orderless等
** Vertico
;;; Vertico提供现代化的垂直补全界面，替代默认的水平补全
#+begin_src emacs-lisp
(use-package vertico
  :load-path "~/.emacs.d/site-lisp/vertico"
  :init
  (require 'vertico)
  (vertico-mode))
#+end_src

** Consult
;;; Consult增强搜索功能，提供统一的搜索接口
#+begin_src emacs-lisp
(use-package consult
  :load-path "~/.emacs.d/site-lisp/consult"
  :bind (("C-s" . consult-line)   ; 行内搜索
         ("C-r". consult-history) ; 搜索历史
         ("M-y". consult-yank-pop) ; 粘贴历史
         ("C-x b". consult-buffer) ; 缓冲区切换
         ("C-c f" . consult-find))) ; 文件查找
#+end_src

** Orderless
;;; Orderless提供灵活的补全匹配方式，支持模糊匹配
#+begin_src emacs-lisp
(use-package orderless
  :load-path "~/.emacs.d/site-lisp/orderless"
  :custom
  (completion-styles '(orderless basic)) ; 设置补全风格
  (completion-category-overrides '((file (styles basic partial-completion))))) ; 文件补全使用基本风格
#+end_src

** Marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :load-path "~/.emacs.d/site-lisp/marginalia"  ; 设置marginalia包的加载路径
  :bind (:map minibuffer-local-map         ; 在minibuffer局部键位映射中绑定快捷键
         ("M-A" . marginalia-cycle))      ; 使用M-A循环切换注解的详细程度
  :init                                   ; 初始化设置
  (require 'marginalia)                   ; 加载marginalia包
  (marginalia-mode))                     ; 启用marginalia次要模式
#+end_src

* Org Mode Configuration
** Basic Org Settings
#+begin_src emacs-lisp
(use-package org
  :ensure nil ;; 使用内置的Org包，不通过package.el安装
  :config
  ;; Org模式美化设置
  (setq org-ellipsis " ▾ ")  ; 设置折叠时显示的省略符号
  (setq org-hide-emphasis-markers t)  ; 隐藏*、/、_等强调标记，使文档更整洁
  
  ;; 缩进和折叠配置
  (setq org-startup-indented t)  ; 启动时启用缩进模式，使文档层次更清晰
  (setq org-indent-mode-turns-on-hiding-stars t)  ; 缩进模式时隐藏标题前的星号
  
  ;; 字体和外观设置
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.3))))  ; 一级标题字体大小
   '(org-level-2 ((t (:inherit outline-2 :height 1.2))))  ; 二级标题字体大小
   '(org-level-3 ((t (:inherit outline-3 :height 1.1))))  ; 三级标题字体大小
   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))  ; 四级标题字体大小
   '(org-level-5 ((t (:inherit outline-5 :height 1.0)))))  ; 五级标题字体大小
  
  ;; 缩进配置
  (setq org-indent-indentation-per-level 2))  ; 每级标题缩进2个空格
#+end_src

** Org ID Configuration
#+begin_src emacs-lisp
(use-package org-id
  :after org  ; 确保在org包加载后执行
  :ensure nil  ; 使用内置的org-id功能，不需要额外安装
  :config
  ;; 设置ID生成方法为时间戳(ts)，确保ID唯一性
  (setq org-id-method 'ts)
  ;; 启用全局ID跟踪，便于跨文件引用
  (setq org-id-track-globally t)
  ;; 指定存储ID位置的文件路径，用于快速查找
  (setq org-id-locations-file "~/.emacs.d/.org-id-locations"))
#+end_src

** Org Babel
;;; 配置Org Babel支持的语言
;;; 这里启用了Emacs Lisp和Shell两种语言的代码块执行功能
;;; 通过org-babel-load-languages变量可以添加更多支持的语言
#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)   ; 启用Emacs Lisp代码块执行
   (shell . t)))      ; 启用Shell代码块执行
#+end_src

** Auto-tangle config.org
;;; 自动将config.org文件中的代码块提取到init.el
;;; 这个功能会在每次保存config.org文件时自动执行
;;; 通过org-babel-tangle函数将org文件中的代码块提取到指定文件
#+begin_src emacs-lisp
(defun tangle-config-org ()
  "Tangle config.org on save."
  ;; 检查当前文件是否为config.org
  (when (equal (buffer-file-name) 
               (expand-file-name "~/.emacs.d/config.org"))
    ;; 执行代码块提取操作
    (org-babel-tangle)))

;; 将tangle-config-org函数添加到after-save-hook
;; 这样每次保存文件时都会自动执行代码提取
(add-hook 'after-save-hook 'tangle-config-org)
#+end_src

* PDF Tools
** PDF Tools Packages
#+begin_src emacs-lisp
;;; PDF工具相关配置
;;; 这里加载了PDF工具的各种子模块，每个模块提供不同的PDF阅读和编辑功能
(use-package pdf-occur
    :commands (pdf-occur-global-minor-mode))  ; 提供PDF全文搜索功能，类似Emacs的occur模式
  (use-package pdf-history
    :commands (pdf-history-minor-mode))      ; 记录PDF浏览历史，支持前进/后退导航
  (use-package pdf-links
    :commands (pdf-links-minor-mode))        ; 处理PDF内部链接和书签
  (use-package pdf-outline
    :commands (pdf-outline-minor-mode))      ; 显示PDF目录大纲
  (use-package pdf-annot
    :commands (pdf-annot-minor-mode))       ; 支持PDF注释功能（高亮、下划线等）
  (use-package pdf-sync
    :commands (pdf-sync-minor-mode))         ; 同步PDF和源文件位置

;;; tablist包提供表格界面，用于PDF工具中的列表显示
(use-package tablist
  :load-path "~/.emacs.d/site-lisp/tablist")
#+end_src

** PDF Tools Configuration
#+begin_src emacs-lisp
(use-package pdf-tools
  :load-path "~/.emacs.d/site-lisp/pdf-tools/lisp/"  ; 设置pdf-tools包的加载路径
  :magic ("%PDF" . pdf-view-mode)  ; 自动检测PDF文件并启用pdf-view-mode
  :config
  (pdf-tools-install)  ; 安装PDF工具核心组件
  (setq-default pdf-view-display-size 'fit-page)  ; 设置默认PDF显示大小为适应页面
  (add-hook 'pdf-view-mode-hook (lambda () 
                                  (display-line-numbers-mode -1)))  ; 在PDF模式下禁用行号显示
  (add-hook 'pdf-view-mode-hook 'pdf-annot-minor-mode)  ; 启用PDF注释功能（高亮、下划线等）
  (add-hook 'pdf-view-mode-hook 'pdf-outline-minor-mode)  ; 启用PDF大纲导航功能
  (add-hook 'pdf-view-mode-hook 'pdf-sync-minor-mode))  ; 启用PDF与源文件位置同步功能
#+end_src

** Org and PDF Integration
#+begin_src emacs-lisp
(with-eval-after-load 'org
  ;; 配置Org Babel支持的语言
  ;; emacs-lisp: 支持执行Emacs Lisp代码块
  ;; shell: 支持执行Shell脚本代码块
  ;; latex: 支持LaTeX代码块编译和预览
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (latex . t))))

;; 设置不同文件类型在Org模式中的默认打开方式
;; auto-mode: 使用Emacs默认模式打开
;; \.mm\': 使用系统默认程序打开FreeMind思维导图文件
;; \.x?html?\': 使用系统默认浏览器打开HTML文件
;; \.pdf\': 使用Emacs的pdf-tools打开PDF文件
(setq org-file-apps
      '((auto-mode . emacs)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . "emacs %s")))
#+end_src

