config.el
(add-to-list 'default-frame-alist '(fullscreen . maximized))

(setq inhibit-startup-message t)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(prefer-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

(let ((default-directory "~/.emacs.d/site-lisp/"))
  (normal-top-level-add-subdirs-to-load-path))

(require 'use-package)
(setq use-package-always-ensure nil)
(add-to-list 'load-path "~/.emacs.d/site-lisp/use-package")
(require 'use-package)

(with-eval-after-load 'info
  (info-initialize)
  (add-to-list 'Info-directory-list
               "~/.emacs.d/site-lisp/use-package/"))

(use-package vertico
  :load-path "~/.emacs.d/site-lisp/vertico"
  :init
  (require 'vertico)
  (vertico-mode))

(use-package consult
  :load-path "~/.emacs.d/site-lisp/consult"
  :bind (("C-s" . consult-line)
         ("C-r". consult-history)
         ("M-y". consult-yank-pop)
         ("C-x b". consult-buffer)
         ("C-c f" . consult-find)))

(use-package orderless
  :load-path "~/.emacs.d/site-lisp/orderless"
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package marginalia
  :load-path "~/.emacs.d/site-lisp/marginalia"
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :init
  (require 'marginalia)
  (marginalia-mode))

(use-package org
  :ensure nil ;; Use the built-in Org package
  :config
  ;; Beautify Org Mode
  (setq org-ellipsis " ▾ ") 
  (setq org-hide-emphasis-markers t)
  ;; Indentation and folding on startup
  (setq org-startup-indented t)
  (setq org-indent-mode-turns-on-hiding-stars t)
  ;; Fontification
  (custom-set-faces
   '(org-level-1 ((t (:inherit outline-1 :height 1.3))))
   '(org-level-2 ((t (:inherit outline-2 :height 1.2))))
   '(org-level-3 ((t (:inherit outline-3 :height 1.1))))
   '(org-level-4 ((t (:inherit outline-4 :height 1.0))))
   '(org-level-5 ((t (:inherit outline-5 :height 1.0)))))
  
  ;; Indentation and folding
  (setq org-indent-indentation-per-level 2))

(use-package org-id
  :after org
  :ensure nil
  :config
  (setq org-id-method 'ts)
  (setq org-id-track-globally t)
  (setq org-id-locations-file "~/.emacs.d/.org-id-locations"))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (shell . t)))

(defun tangle-config-org ()
  "Tangle config.org on save."
  (when (equal (buffer-file-name) 
               (expand-file-name "~/.emacs.d/config.org"))
    (org-babel-tangle)))

(add-hook 'after-save-hook 'tangle-config-org)

(use-package pdf-occur
    :commands (pdf-occur-global-minor-mode))
  (use-package pdf-history
    :commands (pdf-history-minor-mode))
  (use-package pdf-links
    :commands (pdf-links-minor-mode))
  (use-package pdf-outline
    :commands (pdf-outline-minor-mode))
  (use-package pdf-annot
    :commands (pdf-annot-minor-mode))
  (use-package pdf-sync
    :commands (pdf-sync-minor-mode))

(use-package tablist
  :load-path "~/.emacs.d/site-lisp/tablist")

(use-package pdf-tools
  :load-path "~/.emacs.d/site-lisp/pdf-tools/lisp/"
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install)
  (setq-default pdf-view-display-size 'fit-page)
  (add-hook 'pdf-view-mode-hook (lambda () 
                                  (display-line-numbers-mode -1)))
  (add-hook 'pdf-view-mode-hook 'pdf-annot-minor-mode)
  (add-hook 'pdf-view-mode-hook 'pdf-outline-minor-mode)
  (add-hook 'pdf-view-mode-hook 'pdf-sync-minor-mode))

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (shell . t)
     (latex . t))))

(setq org-file-apps
      '((auto-mode . emacs)
        ("\\.mm\\'" . default)
        ("\\.x?html?\\'" . default)
        ("\\.pdf\\'" . "emacs %s")))

(use-package org-roam
  :load-path "~/.emacs.d/site-lisp/org-roam"
  :custom
