config.org
* Org-Roam Configuration
#+begin_src emacs-lisp
(use-package org-roam
  :load-path "~/.emacs.d/site-lisp/org-roam"  ; 设置org-roam包的加载路径
  :custom
  (org-roam-directory (file-truename "~/org-roam"))  ; 设置org-roam笔记存储目录
  (org-roam-completion-everywhere t)  ; 在所有地方启用org-roam补全功能
  (org-roam-capture-templates  ; 定义笔记捕获模板
   '(("d" "默认" plain  ; 默认模板
      "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n")  ; 自动生成文件名和标题
      :unnarrowed t)  ; 不限制编辑区域
     ("m" "数学概念" plain  ; 数学概念模板
      "* 定义\n%?\n\n* 性质\n\n* 例子\n\n* 相关概念\n\n* 参考文献\n"
      :target (file+head "math/${slug}.org"  ; 存储在math子目录
                        "#+title: ${title}\n#+filetags: :math:concept:\n")  ; 自动添加数学概念标签
      :unnarrowed t)
     ("t" "定理" plain  ; 定理模板
      "* 陈述\n%?\n\n* 证明\n\n* 推论\n\n* 应用\n\n* 参考文献\n"
      :target (file+head "math/theorems/${slug}.org"  ; 存储在theorems子目录
                        "#+title: ${title}\n#+filetags: :math:theorem:\n")  ; 自动添加定理标签
      :unnarrowed t)
     ("p" "PDE问题" plain  ; 偏微分方程问题模板
      "* 问题描述\n%?\n\n* 边界条件\n\n* 解法思路\n\n* 解的性质\n\n* 相关文献\n"
      :target (file+head "math/pde/${slug}.org"  ; 存储在pde子目录
                        "#+title: ${title}\n#+filetags: :math:pde:\n")  ; 自动添加PDE标签
      :unnarrowed t)
     ("r" "研究笔记" plain  ; 研究笔记模板
      "* 研究问题\n%?\n\n* 相关工作\n\n* 方法\n\n* 结果\n\n* 下一步计划\n"
      :target (file+head "research/${slug}.org"  ; 存储在research目录
                        "#+title: ${title}\n#+date: %<%Y-%m-%d>\n#+filetags: :research:\n")  ; 自动添加日期和研究标签
      :unnarrowed t)))
  :bind ((:map global-map  ; 全局快捷键绑定
          ("C-c n f" . org-roam-node-find)  ; 查找节点
          ("C-c n i" . org-roam-node-insert)  ; 插入链接
          ("C-c n c" . org-roam-capture)  ; 捕获新笔记
          ("C-c n l" . org-roam-buffer-toggle))  ; 切换侧边栏
         (:map org-mode-map
          ("C-M-i" . completion-at-point)))  ; 在org-mode中启用补全
  :config
  (setq org-roam-ui-sync-theme t  ; 同步UI主题
        org-roam-ui-follow t  ; 跟随当前节点
        org-roam-ui-update-on-save t  ; 保存时更新UI
        org-roam-ui-open-on-start t)  ; 启动时自动打开UI
  
  ;; 创建必要的目录结构
  (unless (file-exists-p org-roam-directory)
    (make-directory org-roam-directory t))
  (unless (file-exists-p (expand-file-name "math" org-roam-directory))
    (make-directory (expand-file-name "math" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "math/theorems" org-roam-directory))
    (make-directory (expand-file-name "math/theorems" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "math/pde" org-roam-directory))
    (make-directory (expand-file-name "math/pde" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "research" org-roam-directory))
    (make-directory (expand-file-name "research" org-roam-directory) t))
  
  (org-roam-db-autosync-mode))  ; 启用数据库自动同步
#+end_src

** Org-Roam-UI
#+begin_src emacs-lisp
(use-package org-roam-ui
  :load-path "~/.emacs.d/site-lisp/org-roam-ui"  ; 设置org-roam-ui包的加载路径
  :after org-roam  ; 确保在org-roam包加载后执行
  :config
  ;; 设置浏览器功能，使用系统默认浏览器打开org-roam-ui界面
  (setq org-roam-ui-browser-function #'browse-url-default-browser))
#+end_src

* LaTeX and Math Input
** cdlatex Configuration
#+begin_src emacs-lisp
(use-package cdlatex
  :load-path "~/.emacs.d/site-lisp/cdlatex"  ; 设置cdlatex包的加载路径
  :hook (org-mode . org-cdlatex-mode)        ; 在org-mode中自动启用cdlatex模式
  :config
  ;; 定义数学符号快捷输入表
  ;; 格式: ("快捷键" "符号" "大写形式")，nil表示无大写形式
  (setq cdlatex-math-symbol-alist
        '(("p" "\\partial" "\\partial")   ; 偏微分符号
          ("e" "\\varepsilon" "\\epsilon") ; ε/ϵ符号
          ("d" "\\delta" "\\Delta")      ; δ/Δ符号
          ("l" "\\lambda" "\\Lambda")    ; λ/Λ符号
          ("g" "\\gamma" "\\Gamma")      ; γ/Γ符号
          ("o" "\\omega" "\\Omega")      ; ω/Ω符号
          ("u" "\\nabla" nil)             ; 梯度算子
          ("s" "\\sigma" "\\Sigma")      ; σ/Σ符号
          ("i" "\\int\\limits_{-\\infty}^{\\infty}" nil) ; 积分符号
          ("8" "\\infty" nil)             ; 无穷大符号
          ("I" "\\oint" nil)              ; 环路积分
          ("*" "\\times" nil)             ; 乘号
          ("." "\\cdot" nil)              ; 点乘
          ("<" "\\langle" nil)             ; 左尖括号
          (">" "\\rangle" nil)            ; 右尖括号
          ("~" "\\tilde" nil)             ; 波浪号修饰
          ("^" "\\hat" nil)               ; 尖角修饰
          ("/" "\\frac{?}{}")))           ; 分数模板
  
  ;; 定义数学符号修饰符
  ;; 格式: ("修饰键" "修饰命令" 是否作用于环境 是否作用于符号 是否作用于命令 是否作用于数字)
  (setq cdlatex-math-modify-alist
        '(("b" "\\mathbf" nil t nil nil)    ; 加粗修饰
          ("c" "\\mathcal" nil t nil nil)  ; 花体修饰
          ("B" "\\boldsymbol" nil t nil nil) ; 向量修饰
          ("r" "\\mathrm" nil t nil nil)  ; 罗马体修饰
          ("v" "\\vec" nil t nil nil)))    ; 向量修饰
  
  ;; 定义LaTeX环境模板
  ;; 格式: ("环境名" "环境模板" 光标位置)
  (setq cdlatex-env-alist
        '(("eqn" "\\begin{equation}
?\\end{equation}"
           nil)                              ; 单行公式环境
          ("ali" "\\begin{align}
?\\end{align}"
           nil)                              ; 对齐公式环境
          ("gat" "\\begin{gather}
?\\end{gather}"
           nil)                              ; 多行公式环境
          ("thm" "\\begin{theorem}
?\\end{theorem}"
           nil)                              ; 定理环境
          ("lem" "\\begin{lemma}
?\\end{lemma}"
           nil)                              ; 引理环境
          ("prf" "\\begin{proof}
?\\end{proof}"
           nil)                              ; 证明环境
          ("def" "\\begin{definition}
?\\end{definition}"
           nil)                              ; 定义环境
          ("prop" "\\begin{proposition}
?\\end{proposition}"
           nil))))                           ; 命题环境
#+end_src

* Bibliography Management
** Dependencies
#+begin_src emacs-lisp
(use-package compat
  :load-path "~/.emacs.d/site-lisp/compat")

(use-package dash
  :load-path "~/.emacs.d/site-lisp/dash.el")

(use-package websocket
  :load-path "~/.emacs.d/site-lisp/emacs-websocket")

(use-package f
  :load-path "~/.emacs.d/site-lisp/f.el")

(use-package s
  :load-path "~/.emacs.d/site-lisp/s.el")

(use-package parsebib
  :load-path "~/.emacs.d/site-lisp/parsebib")

(use-package async
  :load-path "~/.emacs.d/site-lisp/emacs-async")

(use-package biblio
  :load-path "~/.emacs.d/site-lisp/biblio.el")

(use-package ox-pandoc
  :load-path "~/.emacs.d/site-lisp/ox-pandoc")

(use-package ht
  :load-path "~/.emacs.d/site-lisp/ht.el")

(use-package citeproc
  :load-path "~/.emacs.d/site-lisp/citeproc-el")

(use-package queue
  :load-path "~/.emacs.d/site-lisp/queue")

(use-package avy
  :load-path "~/.emacs.d/site-lisp/avy")

(use-package request
  :load-path "~/.emacs.d/site-lisp/emacs-request")

(use-package helm
  :load-path "~/.emacs.d/site-lisp/helm")

(use-package helm-bibtex
  :load-path "~/.emacs.d/site-lisp/helm-bibtex"
  :after (helm))
#+end_src

** org-ref Configuration
#+begin_src emacs-lisp
(use-package org-ref
  :load-path "~/.emacs.d/site-lisp/org-ref"  ; 设置org-ref包的加载路径
  :after (org dash f s parsebib helm-bibtex)  ; 确保在这些依赖包加载后执行
  :config
  ;; 设置参考文献管理系统的默认路径
  (setq org-ref-default-bibliography '("~/org-roam/bibliography/references.bib")  ; 默认参考文献库文件路径
        org-ref-pdf-directory "~/org-roam/bibliography/pdfs/"  ; PDF文献存储目录
        org-ref-notes-directory "~/org-roam/bibliography/notes/")  ; 文献笔记存储目录
  
  ;; 自动创建必要的目录结构
  (unless (file-exists-p "~/org-roam/bibliography")
    (make-directory "~/org-roam/bibliography" t))  ; 创建主文献目录
  (unless (file-exists-p org-ref-pdf-directory)
    (make-directory org-ref-pdf-directory t))  ; 创建PDF存储目录
  (unless (file-exists-p org-ref-notes-directory)
    (make-directory org-ref-notes-directory t))  ; 创建笔记存储目录
  
  ;; 配置参考文献系统的其他参数
  (setq org-ref-completion-library 'org-ref-ivy-cite  ; 使用ivy作为补全前端
        org-export-latex-format-toc-function 'org-export-latex-no-toc  ; 禁用LaTeX导出时的目录生成
        org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex  ; 使用helm-bibtex获取PDF文件名
        org-ref-note-title-format "* %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :AUTHOR: %a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"))
#+end_src

* AI Integration
