config.el
  (org-roam-directory (file-truename "~/org-roam"))
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "默认" plain
      "%?" :target
      (file+head "${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("m" "数学概念" plain
      "* 定义\n%?\n\n* 性质\n\n* 例子\n\n* 相关概念\n\n* 参考文献\n"
      :target (file+head "math/${slug}.org"
                        "#+title: ${title}\n#+filetags: :math:concept:\n")
      :unnarrowed t)
     ("t" "定理" plain
      "* 陈述\n%?\n\n* 证明\n\n* 推论\n\n* 应用\n\n* 参考文献\n"
      :target (file+head "math/theorems/${slug}.org"
                        "#+title: ${title}\n#+filetags: :math:theorem:\n")
      :unnarrowed t)
     ("p" "PDE问题" plain
      "* 问题描述\n%?\n\n* 边界条件\n\n* 解法思路\n\n* 解的性质\n\n* 相关文献\n"
      :target (file+head "math/pde/${slug}.org"
                        "#+title: ${title}\n#+filetags: :math:pde:\n")
      :unnarrowed t)
     ("r" "研究笔记" plain
      "* 研究问题\n%?\n\n* 相关工作\n\n* 方法\n\n* 结果\n\n* 下一步计划\n"
      :target (file+head "research/${slug}.org"
                        "#+title: ${title}\n#+date: %<%Y-%m-%d>\n#+filetags: :research:\n")
      :unnarrowed t)))
  :bind ((:map global-map
          ("C-c n f" . org-roam-node-find)
          ("C-c n i" . org-roam-node-insert)
          ("C-c n c" . org-roam-capture)
          ("C-c n l" . org-roam-buffer-toggle))
         (:map org-mode-map
          ("C-M-i" . completion-at-point)))
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t)
  
  (unless (file-exists-p org-roam-directory)
    (make-directory org-roam-directory t))
  (unless (file-exists-p (expand-file-name "math" org-roam-directory))
    (make-directory (expand-file-name "math" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "math/theorems" org-roam-directory))
    (make-directory (expand-file-name "math/theorems" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "math/pde" org-roam-directory))
    (make-directory (expand-file-name "math/pde" org-roam-directory) t))
  (unless (file-exists-p (expand-file-name "research" org-roam-directory))
    (make-directory (expand-file-name "research" org-roam-directory) t))
  
  (org-roam-db-autosync-mode))

(use-package org-roam-ui
  :load-path "~/.emacs.d/site-lisp/org-roam-ui"
  :after org-roam
  :config
  (setq org-roam-ui-browser-function #'browse-url-default-browser))

(use-package cdlatex
  :load-path "~/.emacs.d/site-lisp/cdlatex"
  :hook (org-mode . org-cdlatex-mode)
  :config
  (setq cdlatex-math-symbol-alist
        '(("p" "\\partial" "\\partial")
          ("e" "\\varepsilon" "\\epsilon")
          ("d" "\\delta" "\\Delta")
          ("l" "\\lambda" "\\Lambda")
          ("g" "\\gamma" "\\Gamma")
          ("o" "\\omega" "\\Omega")
          ("u" "\\nabla" nil)
          ("s" "\\sigma" "\\Sigma")
          ("i" "\\int\\limits_{-\\infty}^{\\infty}" nil)
          ("8" "\\infty" nil)
          ("I" "\\oint" nil)
          ("*" "\\times" nil)
          ("." "\\cdot" nil)
          ("<" "\\langle" nil)
          (">" "\\rangle" nil)
          ("~" "\\tilde" nil)
          ("^" "\\hat" nil)
          ("/" "\\frac{?}{}"))
        cdlatex-math-modify-alist
        '(("b" "\\mathbf" nil t nil nil)
          ("c" "\\mathcal" nil t nil nil)
          ("B" "\\boldsymbol" nil t nil nil)
          ("r" "\\mathrm" nil t nil nil)
          ("v" "\\vec" nil t nil nil)))
  
  (setq cdlatex-env-alist
        '(("eqn" "\\begin{equation}
?\\end{equation}"
           nil)
          ("ali" "\\begin{align}
?\\end{align}"
           nil)
          ("gat" "\\begin{gather}
?\\end{gather}"
           nil)
          ("thm" "\\begin{theorem}
?\\end{theorem}"
           nil)
          ("lem" "\\begin{lemma}
?\\end{lemma}"
           nil)
          ("prf" "\\begin{proof}
?\\end{proof}"
           nil)
          ("def" "\\begin{definition}
?\\end{definition}"
           nil)
          ("prop" "\\begin{proposition}
?\\end{proposition}"
           nil))))

(use-package compat
  :load-path "~/.emacs.d/site-lisp/compat")

(use-package dash
  :load-path "~/.emacs.d/site-lisp/dash.el")

(use-package websocket
  :load-path "~/.emacs.d/site-lisp/emacs-websocket")

(use-package f
  :load-path "~/.emacs.d/site-lisp/f.el")

(use-package s
  :load-path "~/.emacs.d/site-lisp/s.el")

(use-package parsebib
  :load-path "~/.emacs.d/site-lisp/parsebib")

(use-package async
  :load-path "~/.emacs.d/site-lisp/emacs-async")

(use-package biblio
  :load-path "~/.emacs.d/site-lisp/biblio.el")

(use-package ox-pandoc
  :load-path "~/.emacs.d/site-lisp/ox-pandoc")

(use-package ht
  :load-path "~/.emacs.d/site-lisp/ht.el")

(use-package citeproc
  :load-path "~/.emacs.d/site-lisp/citeproc-el")

(use-package queue
  :load-path "~/.emacs.d/site-lisp/queue")

(use-package avy
  :load-path "~/.emacs.d/site-lisp/avy")

(use-package request
  :load-path "~/.emacs.d/site-lisp/emacs-request")

(use-package helm
  :load-path "~/.emacs.d/site-lisp/helm")

(use-package helm-bibtex
  :load-path "~/.emacs.d/site-lisp/helm-bibtex"
  :after (helm))

(use-package org-ref
  :load-path "~/.emacs.d/site-lisp/org-ref"
  :after (org dash f s parsebib helm-bibtex)
  :config
  (setq org-ref-default-bibliography '("~/org-roam/bibliography/references.bib")
        org-ref-pdf-directory "~/org-roam/bibliography/pdfs/"
        org-ref-notes-directory "~/org-roam/bibliography/notes/")
  
  (unless (file-exists-p "~/org-roam/bibliography")
    (make-directory "~/org-roam/bibliography" t))
  (unless (file-exists-p org-ref-pdf-directory)
    (make-directory org-ref-pdf-directory t))
  (unless (file-exists-p org-ref-notes-directory)
    (make-directory org-ref-notes-directory t))
  
  (setq org-ref-completion-library 'org-ref-ivy-cite
        org-export-latex-format-toc-function 'org-export-latex-no-toc
        org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
        org-ref-note-title-format "* %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :AUTHOR: %a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"))
