config.org
** org-ai Configuration
#+begin_src emacs-lisp
(use-package org-ai
  :load-path "~/.emacs.d/site-lisp/org-ai"  ; 设置org-ai包的加载路径
  :after (org websocket)  ; 确保在org和websocket包加载后执行
  :custom
  ;; AI模型配置
  (org-ai-default-chat-model "deepseek-chat")  ; 设置默认聊天模型为deepseek
  ;;(org-ai-deepseek-api-key (getenv "DEEPSEEK_API_KEY"))  ; 从环境变量获取Deepseek API密钥
  (org-ai-deepseek-api-base-url "https://api.deepseek.com/v1")  ; Deepseek API基础URL
  
  ;; 其他AI服务API密钥配置
  ;;(org-ai-openai-api-key (getenv "OPENAI_API_KEY"))  ; OpenAI API密钥
  ;;(org-ai-anthropic-api-key (getenv "ANTHROPIC_API_KEY"))  ; Anthropic API密钥
  
  ;; 预定义提示模板
  (org-ai-prompt-templates
   '(("math-explain" . "请详细解释以下数学概念或定理：\n\n$x")  ; 数学概念解释模板
     ("math-proof" . "请提供以下定理的详细证明：\n\n$x")  ; 定理证明模板
     ("math-example" . "请提供一个关于$x的具体例子，并详细解释")  ; 数学示例模板
     ("pde-solve" . "请解决以下偏微分方程问题并详细说明解法步骤：\n\n$x")  ; PDE求解模板
     ("latex-fix" . "请修正以下LaTeX代码中的错误：\n\n$x")  ; LaTeX修正模板
     ("summarize-paper" . "请总结以下研究论文的主要内容、方法和贡献：\n\n$x")))  ; 论文总结模板
  
  :config
  (org-ai-global-mode)
  
  (defun my/org-ai-math-explain ()
    "使用AI解释选中的数学内容"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI解释\n#+begin_ai\n请详细解释以下数学概念或定理：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要解释的数学内容")))
  
  (defun my/org-ai-math-proof ()
    "使用AI生成选中定理的证明"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI证明\n#+begin_ai\n请提供以下定理的详细证明：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要证明的定理")))
  
  (defun my/org-ai-pde-solve ()
    "使用AI辅助解决PDE问题"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI求解\n#+begin_ai\n请解决以下偏微分方程问题并详细说明解法步骤：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要求解的PDE问题")))
  
  (global-set-key (kbd "C-c a e") 'my/org-ai-math-explain)
  (global-set-key (kbd "C-c a p") 'my/org-ai-math-proof)
  (global-set-key (kbd "C-c a s") 'my/org-ai-pde-solve)
  (global-set-key (kbd "C-c a i") 'org-ai-prompt)
  (global-set-key (kbd "C-c a c") 'org-ai-chat))
#+end_src

* Keybindings and Workflow
** Hydra Menu for Math Notes
#+begin_src emacs-lisp
(use-package hydra
  :load-path "~/.emacs.d/site-lisp/hydra"  ; 设置hydra包的加载路径
  :config
  ;; 定义数学笔记操作的水合菜单
  ;; 水合菜单提供了一种交互式界面，通过快捷键快速访问常用功能
  ;; :color blue - 设置菜单颜色为蓝色
  ;; :hint nil - 不显示默认提示信息，使用自定义布局
  (defhydra hydra-math-notes (:color blue :hint nil)
    "
^笔记操作^          ^公式^              ^引用^           ^AI辅助^
^^^^^^^^-----------------------------------------------------------------
_f_: 查找笔记      _e_: 编辑公式      _c_: 插入引用    _E_: AI解释
_i_: 插入链接      _n_: 新公式块      _b_: 打开文献    _P_: AI证明
_t_: 添加标签      _a_: 对齐环境      _r_: 刷新文献    _S_: AI求解PDE
_d_: 日常笔记      _s_: 插入符号      _p_: 预览PDF     _C_: AI对话
"
    ;; 笔记操作相关功能
    ("f" org-roam-node-find)       ; 查找并打开org-roam笔记
    ("i" org-roam-node-insert)     ; 插入org-roam笔记链接
    ("t" org-roam-tag-add)         ; 为当前笔记添加标签
    ("d" (org-roam-capture- :node (org-roam-node-create) :templates '(("d" "默认" plain "%?" :target (file+head "${slug}.org" "#+title: ${title}\n") :unnarrowed t))))  ; 快速创建日常笔记
    
    ;; LaTeX公式编辑功能
    ("e" org-cdlatex-environment)  ; 插入LaTeX环境
    ("n" (lambda () (interactive) (insert "\\begin{equation}\n\n\\end{equation}") (forward-line -1)))  ; 插入单行公式环境
    ("a" (lambda () (interactive) (insert "\\begin{align}\n\n\\end{align}") (forward-line -1)))  ; 插入对齐公式环境
    ("s" cdlatex-math-symbol)      ; 插入数学符号
    
    ;; 文献引用功能
    ("c" org-ref-cite-insert-ivy)  ; 插入文献引用
    ("b" org-ref-open-bibtex-notes) ; 打开文献笔记
    ("r" org-ref-bibliography-refresh) ; 刷新文献数据库
    ("p" org-latex-preview)        ; 预览LaTeX公式
    
    ;; AI辅助功能
    ("E" my/org-ai-math-explain)  ; AI解释数学概念
    ("P" my/org-ai-math-proof)    ; AI提供数学证明
    ("S" my/org-ai-pde-solve)     ; AI求解偏微分方程
    ("C" org-ai-chat)             ; 与AI对话
    
    ("q" nil "退出" :color blue))  ; 退出水合菜单
  
  ;; 将水合菜单绑定到快捷键C-c m
  (global-set-key (kbd "C-c m") 'hydra-math-notes/body))
#+end_src

** Org Capture Templates
#+begin_src emacs-lisp
(with-eval-after-load 'org
  ;; 设置Org模式捕获模板
  ;; 捕获模板格式: ("键" "描述" 类型 目标位置 模板内容)
  (setq org-capture-templates
        '(;; 待办事项模板
          ;; 键: t, 描述: "待办事项"
          ;; 类型: entry (条目)
          ;; 目标位置: ~/org-roam/gtd.org文件的Tasks标题下
          ;; 模板内容: 以TODO开头的条目，包含%?(光标位置)、%i(初始内容)和%a(来源链接)
          ("t" "待办事项" entry
           (file+headline "~/org-roam/gtd.org" "Tasks")
           "* TODO %?\n  %i\n  %a")
          
          ;; 研究笔记模板
          ;; 键: n, 描述: "研究笔记"
          ;; 类型: entry (条目)
          ;; 目标位置: ~/org-roam/research_notes.org文件的Notes标题下
          ;; 模板内容: 普通条目，包含%?(光标位置)、%U(时间戳)和%i(初始内容)
          ("n" "研究笔记" entry
           (file+headline "~/org-roam/research_notes.org" "Notes")
           "* %?\n  %U\n  %i")
          
          ;; 研究日志模板
          ;; 键: j, 描述: "研究日志"
          ;; 类型: entry (条目)
          ;; 目标位置: ~/org-roam/research_journal.org文件的日期树中
          ;; 模板内容: 普通条目，包含%?(光标位置)、%U(时间戳)和%i(初始内容)
          ("j" "研究日志" entry
           (file+datetree "~/org-roam/research_journal.org")
           "* %?\n  %U\n  %i")
          
          ;; 研究想法模板
          ;; 键: i, 描述: "研究想法"
          ;; 类型: entry (条目)
          ;; 目标位置: ~/org-roam/research_ideas.org文件的Ideas标题下
          ;; 模板内容: 普通条目，包含%?(光标位置)、%U(时间戳)和%i(初始内容)
          ("i" "研究想法" entry
           (file+headline "~/org-roam/research_ideas.org" "Ideas")
           "* %?\n  %U\n  %i"))))
#+end_src

* Modal Editing with Meow
