config.el

(use-package org-ai
  :load-path "~/.emacs.d/site-lisp/org-ai"
  :after (org websocket)
  :custom
  (org-ai-default-chat-model "deepseek")
  (org-ai-deepseek-api-key (getenv "DEEPSEEK_API_KEY"))
  (org-ai-deepseek-api-base-url "https://api.deepseek.com/v1")
  
  (org-ai-openai-api-key (getenv "OPENAI_API_KEY"))
  (org-ai-anthropic-api-key (getenv "ANTHROPIC_API_KEY"))
  
  (org-ai-prompt-templates
   '(("math-explain" . "请详细解释以下数学概念或定理：\n\n$x")
     ("math-proof" . "请提供以下定理的详细证明：\n\n$x")
     ("math-example" . "请提供一个关于$x的具体例子，并详细解释")
     ("pde-solve" . "请解决以下偏微分方程问题并详细说明解法步骤：\n\n$x")
     ("latex-fix" . "请修正以下LaTeX代码中的错误：\n\n$x")
     ("summarize-paper" . "请总结以下研究论文的主要内容、方法和贡献：\n\n$x")))
  
  :config
  (org-ai-global-mode)
  
  (defun my/org-ai-math-explain ()
    "使用AI解释选中的数学内容"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI解释\n#+begin_ai\n请详细解释以下数学概念或定理：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要解释的数学内容")))
  
  (defun my/org-ai-math-proof ()
    "使用AI生成选中定理的证明"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI证明\n#+begin_ai\n请提供以下定理的详细证明：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要证明的定理")))
  
  (defun my/org-ai-pde-solve ()
    "使用AI辅助解决PDE问题"
    (interactive)
    (if (use-region-p)
        (let ((content (buffer-substring-no-properties (region-beginning) (region-end))))
          (deactivate-mark)
          (insert (format "\n** AI求解\n#+begin_ai\n请解决以下偏微分方程问题并详细说明解法步骤：\n\n%s\n#+end_ai\n" content)))
      (message "请先选择要求解的PDE问题")))
  
  (global-set-key (kbd "C-c a e") 'my/org-ai-math-explain)
  (global-set-key (kbd "C-c a p") 'my/org-ai-math-proof)
  (global-set-key (kbd "C-c a s") 'my/org-ai-pde-solve)
  (global-set-key (kbd "C-c a i") 'org-ai-prompt)
  (global-set-key (kbd "C-c a c") 'org-ai-chat))

(use-package hydra
  :load-path "~/.emacs.d/site-lisp/hydra"
  :config
  (defhydra hydra-math-notes (:color blue :hint nil)
    "
^笔记操作^          ^公式^              ^引用^           ^AI辅助^
^^^^^^^^-----------------------------------------------------------------
_f_: 查找笔记      _e_: 编辑公式      _c_: 插入引用    _E_: AI解释
_i_: 插入链接      _n_: 新公式块      _b_: 打开文献    _P_: AI证明
_t_: 添加标签      _a_: 对齐环境      _r_: 刷新文献    _S_: AI求解PDE
_d_: 日常笔记      _s_: 插入符号      _p_: 预览PDF     _C_: AI对话
"
    ("f" org-roam-node-find)
    ("i" org-roam-node-insert)
    ("t" org-roam-tag-add)
    ("d" (org-roam-capture- :node (org-roam-node-create) :templates '(("d" "默认" plain "%?" :target (file+head "${slug}.org" "#+title: ${title}\n") :unnarrowed t))))
    ("e" org-cdlatex-environment)
    ("n" (lambda () (interactive) (insert "\\begin{equation}\n\n\\end{equation}") (forward-line -1)))
    ("a" (lambda () (interactive) (insert "\\begin{align}\n\n\\end{align}") (forward-line -1)))
    ("s" cdlatex-math-symbol)
    ("c" org-ref-cite-insert-ivy)
    ("b" org-ref-open-bibtex-notes)
    ("r" org-ref-bibliography-refresh)
    ("p" org-latex-preview)
    ("E" my/org-ai-math-explain)
    ("P" my/org-ai-math-proof)
    ("S" my/org-ai-pde-solve)
    ("C" org-ai-chat)
    ("q" nil "退出" :color blue))
  
  (global-set-key (kbd "C-c m") 'hydra-math-notes/body))

(with-eval-after-load 'org
  (setq org-capture-templates
        '(("t" "待办事项" entry
           (file+headline "~/org-roam/gtd.org" "Tasks")
           "* TODO %?\n  %i\n  %a")
          ("n" "研究笔记" entry
           (file+headline "~/org-roam/research_notes.org" "Notes")
           "* %?\n  %U\n  %i")
          ("j" "研究日志" entry
           (file+datetree "~/org-roam/research_journal.org")
           "* %?\n  %U\n  %i")
          ("i" "研究想法" entry
           (file+headline "~/org-roam/research_ideas.org" "Ideas")
           "* %?\n  %U\n  %i"))))
