config.org
** Meow Configuration
#+begin_src emacs-lisp
(use-package meow
  :load-path "~/.emacs.d/site-lisp/meow"  ; 设置meow包的加载路径
  :init
  (require 'meow-cheatsheet-layout)  ; 加载快捷键帮助布局
  (require 'meow)  ; 加载meow主模块
  
  (defun meow-setup-mac ()
    "配置macOS平台下的meow键位绑定"
    ;; 设置QWERTY键盘布局的快捷键帮助
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    
    ;; 定义运动模式下的键位绑定
    (meow-motion-define-key
     '("j" . meow-next)  ; 向下移动
     '("k" . meow-prev)  ; 向上移动
     '("<escape>" . ignore))  ; 忽略ESC键
    
    ;; 定义leader键(默认是SPC)的快捷键绑定
    (meow-leader-define-key
     ;; 数字参数
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     
     ;; 常用功能
     '("b" . consult-buffer)  ; 切换缓冲区
     '("f" . find-file)  ; 打开文件
     '("w" . save-buffer)  ; 保存当前缓冲区
     '("k" . kill-this-buffer)  ; 关闭当前缓冲区
     '("s" . save-some-buffers)  ; 保存所有缓冲区
     '("d" . dired-jump)  ; 跳转到目录
     '("o" . delete-other-windows)  ; 删除其他窗口
     '("v" . split-window-vertically)  ; 垂直分割窗口
     '("h" . split-window-horizontally)  ; 水平分割窗口
     '("p" . project-find-file)  ; 在项目中查找文件
     '("g" . magit-status)  ; 打开magit状态
     
     ;; 帮助功能
     '("/" . meow-keypad-describe-key)  ; 描述键位功能
     '("?" . meow-cheatsheet))  ; 显示快捷键帮助
    
    ;; 定义普通模式下的键位绑定
    (meow-normal-define-key
     ;; 数字扩展
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)  ; 负数参数
     
     ;; 导航与选择
     '(";" . meow-reverse)  ; 反转选择方向
     '("," . meow-inner-of-thing)  ; 选择对象内部
     '("." . meow-bounds-of-thing)  ; 选择对象边界
     '("[" . meow-beginning-of-thing)  ; 移动到对象开始
     '("]" . meow-end-of-thing)  ; 移动到对象结束
     
     ;; 编辑操作
     '("a" . meow-append)  ; 在光标后插入
     '("A" . meow-open-below)  ; 在下方插入新行
     '("b" . meow-back-word)  ; 向后移动一个单词
     '("B" . meow-back-symbol)  ; 向后移动一个符号
     '("c" . meow-change)  ; 修改选中内容
     '("d" . meow-delete)  ; 删除选中内容
     '("D" . meow-backward-delete)  ; 向后删除
     '("e" . meow-next-word)  ; 向前移动一个单词
     '("E" . meow-next-symbol)  ; 向前移动一个符号
     '("f" . meow-find)  ; 查找字符
     '("g" . meow-cancel-selection)  ; 取消选择
     '("G" . meow-grab)  ; 抓取选择
     '("h" . meow-left)  ; 向左移动
     '("H" . meow-left-expand)  ; 向左扩展选择
     '("i" . meow-insert)  ; 在光标前插入
     '("I" . meow-open-above)  ; 在上方插入新行
     '("j" . meow-next)  ; 向下移动
     '("J" . meow-next-expand)  ; 向下扩展选择
     '("k" . meow-prev)  ; 向上移动
     '("K" . meow-prev-expand)  ; 向上扩展选择
     '("l" . meow-right)  ; 向右移动
     '("L" . meow-right-expand)  ; 向右扩展选择
     '("m" . meow-join)  ; 合并行
     '("o" . meow-block)  ; 选择块
     '("O" . meow-to-block)  ; 移动到块
     '("p" . meow-yank)  ; 粘贴
     '("q" . meow-quit)  ; 退出
     '("Q" . meow-goto-line)  ; 跳转到行
     '("r" . meow-replace)  ; 替换
     '("R" . meow-swap-grab)  ; 交换抓取
     '("s" . meow-kill)  ; 剪切
     '("t" . meow-till)  ; 移动到字符前
     '("u" . meow-undo)  ; 撤销
     '("U" . meow-undo-in-selection)  ; 在选择中撤销
     '("v" . meow-visit)  ; 访问
     '("w" . meow-mark-word)  ; 标记单词
     '("W" . meow-mark-symbol)  ; 标记符号
     '("x" . meow-line)  ; 选择行
     '("X" . meow-goto-line)  ; 跳转到行
     '("y" . meow-save)  ; 保存
     '("Y" . meow-sync-grab)  ; 同步抓取
     '("z" . meow-pop-selection)  ; 弹出选择
     '("'" . repeat)  ; 重复
     '("<escape>" . ignore))  ; 忽略ESC键
  
  ;; 应用macOS特定的键位配置
  (meow-setup-mac)
  
  ;; 设置macOS修饰键映射
  (setq mac-command-modifier 'meta)  ; Command键作为Meta键
  (setq mac-option-modifier 'super)  ; Option键作为Super键
  (setq mac-right-option-modifier 'none)  ; 右侧Option键不修改
  
  :config
  ;; 设置不同模式下的光标类型
  (setq meow-cursor-type-normal 'box)  ; 普通模式: 方块光标
  (setq meow-cursor-type-insert '(bar . 2))  ; 插入模式: 竖线光标(高度2)
  (setq meow-cursor-type-motion 'hollow)  ; 运动模式: 空心方块
  
  ;; 设置状态名称替换表
  (setq meow-replace-state-name-alist
        '((normal . "N")  ; 普通模式
          (insert . "I")  ; 插入模式
          (motion . "M")  ; 运动模式
          (keypad . "K")))  ; 键位模式
  
  ;; 启用全局meow模式
  (meow-global-mode 1))
#+end_src

* Chinese Input Support
** Pinyin Support
#+begin_src emacs-lisp
(use-package pinyinlib
  :load-path "~/.emacs.d/site-lisp/pinyinlib.el")

(use-package ace-pinyin
  :init
  (setq ace-pinyin-use-avy t)
  :config
  (ace-pinyin-global-mode +1))
#+end_src

** Meow Integration
#+begin_src emacs-lisp
(with-eval-after-load 'meow
  ;; 设置不同模式下的默认状态
  ;; 以下模式使用motion状态（移动模式）
  (add-to-list 'meow-mode-state-list '(pdf-view-mode . motion))  ; PDF查看模式
  (add-to-list 'meow-mode-state-list '(dired-mode . motion))    ; 文件管理器模式
  (add-to-list 'meow-mode-state-list '(org-agenda-mode . motion)) ; Org日程模式
  (add-to-list 'meow-mode-state-list '(magit-status-mode . motion)) ; Git状态模式
  (add-to-list 'meow-mode-state-list '(helpful-mode . motion))  ; 帮助模式
  (add-to-list 'meow-mode-state-list '(help-mode . motion))     ; 帮助模式
  
  ;; Org模式使用normal状态（普通模式）
  (add-to-list 'meow-mode-state-list '(org-mode . normal))
  ;; 在普通模式下绑定TAB键为org-cycle（折叠/展开Org标题）
  (meow-define-keys
   'normal
   '("TAB" . org-cycle))
  
  ;; 集成ace-pinyin中文跳转功能
  (with-eval-after-load 'ace-pinyin
    (meow-define-keys
     'normal
     '("v" . ace-pinyin-jump-char-2)      ; 按拼音首字母跳转字符
     '("V" . ace-pinyin-jump-char-in-line))) ; 在当前行按拼音首字母跳转
  
  ;; 集成org-roam快捷键
  (with-eval-after-load 'org-roam
    (meow-leader-define-key
     '("n f" . org-roam-node-find)    ; 查找节点
     '("n i" . org-roam-node-insert)  ; 插入链接
     '("n c" . org-roam-capture)      ; 捕获新笔记
     '("n l" . org-roam-buffer-toggle)))) ; 切换侧边栏

(defun meow-debug-info ()
  "显示 Meow 的调试信息。"
  (interactive)
  (let ((buf (get-buffer-create "*Meow Debug*")))
    (with-current-buffer buf
      (erase-buffer)
      (insert (format "Meow 版本: %s\n" (if (fboundp 'meow-version)
                                         (meow-version)
                                       "未知")))
      (insert (format "当前状态: %s\n" meow--current-state))
      (insert (format "全局模式状态: %s\n" (if meow-global-mode "已启用" "未启用")))
      (insert "\n模式状态列表:\n")
      (dolist (mode-state meow-mode-state-list)
        (insert (format "  %s: %s\n" (car mode-state) (cdr mode-state))))
      (insert "\n键位映射:\n")
      (insert "  普通模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'normal meow--kbd-alist)))))
      (insert "  插入模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'insert meow--kbd-alist)))))
      (insert "  移动模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'motion meow--kbd-alist)))))
      (insert "  Leader键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'leader meow--kbd-alist))))))
    (switch-to-buffer buf)))

(with-eval-after-load 'meow
  (meow-leader-define-key
   '("M-d" . meow-debug-info)))
#+end_src