config.el

(use-package meow
  :load-path "~/.emacs.d/site-lisp/meow"
  :init
  (require 'meow-cheatsheet-layout)
  (require 'meow)
  
  (defun meow-setup-mac ()
    (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
    
    (meow-motion-define-key
     '("j" . meow-next)
     '("k" . meow-prev)
     '("<escape>" . ignore))
    
    (meow-leader-define-key
     '("1" . meow-digit-argument)
     '("2" . meow-digit-argument)
     '("3" . meow-digit-argument)
     '("4" . meow-digit-argument)
     '("5" . meow-digit-argument)
     '("6" . meow-digit-argument)
     '("7" . meow-digit-argument)
     '("8" . meow-digit-argument)
     '("9" . meow-digit-argument)
     '("0" . meow-digit-argument)
     
     '("b" . consult-buffer)
     '("f" . find-file)
     '("w" . save-buffer)
     '("k" . kill-this-buffer)
     '("s" . save-some-buffers)
     '("d" . dired-jump)
     '("o" . delete-other-windows)
     '("v" . split-window-vertically)
     '("h" . split-window-horizontally)
     '("p" . project-find-file)
     '("g" . magit-status)
     
     '("/" . meow-keypad-describe-key)
     '("?" . meow-cheatsheet))
    
    (meow-normal-define-key
     '("0" . meow-expand-0)
     '("9" . meow-expand-9)
     '("8" . meow-expand-8)
     '("7" . meow-expand-7)
     '("6" . meow-expand-6)
     '("5" . meow-expand-5)
     '("4" . meow-expand-4)
     '("3" . meow-expand-3)
     '("2" . meow-expand-2)
     '("1" . meow-expand-1)
     '("-" . negative-argument)
     '(";" . meow-reverse)
     '("," . meow-inner-of-thing)
     '("." . meow-bounds-of-thing)
     '("[" . meow-beginning-of-thing)
     '("]" . meow-end-of-thing)
     '("a" . meow-append)
     '("A" . meow-open-below)
     '("b" . meow-back-word)
     '("B" . meow-back-symbol)
     '("c" . meow-change)
     '("d" . meow-delete)
     '("D" . meow-backward-delete)
     '("e" . meow-next-word)
     '("E" . meow-next-symbol)
     '("f" . meow-find)
     '("g" . meow-cancel-selection)
     '("G" . meow-grab)
     '("h" . meow-left)
     '("H" . meow-left-expand)
     '("i" . meow-insert)
     '("I" . meow-open-above)
     '("j" . meow-next)
     '("J" . meow-next-expand)
     '("k" . meow-prev)
     '("K" . meow-prev-expand)
     '("l" . meow-right)
     '("L" . meow-right-expand)
     '("m" . meow-join)
     '("o" . meow-block)
     '("O" . meow-to-block)
     '("p" . meow-yank)
     '("q" . meow-quit)
     '("Q" . meow-goto-line)
     '("r" . meow-replace)
     '("R" . meow-swap-grab)
     '("s" . meow-kill)
     '("t" . meow-till)
     '("u" . meow-undo)
     '("U" . meow-undo-in-selection)
     '("v" . meow-visit)
     '("w" . meow-mark-word)
     '("W" . meow-mark-symbol)
     '("x" . meow-line)
     '("X" . meow-goto-line)
     '("y" . meow-save)
     '("Y" . meow-sync-grab)
     '("z" . meow-pop-selection)
     '("'" . repeat)
     '("<escape>" . ignore)))
  
  (meow-setup-mac)
  
  (setq mac-command-modifier 'meta)
  (setq mac-option-modifier 'super)
  (setq mac-right-option-modifier 'none)
  
  :config
  (setq meow-cursor-type-normal 'box)
  (setq meow-cursor-type-insert '(bar . 2))
  (setq meow-cursor-type-motion 'hollow)
  
  (setq meow-replace-state-name-alist
        '((normal . "N")
          (insert . "I")
          (motion . "M")
          (keypad . "K")))
  
  (meow-global-mode 1))

(use-package pinyinlib
  :load-path "~/.emacs.d/site-lisp/pinyinlib.el")

(use-package ace-pinyin
  :init
  (setq ace-pinyin-use-avy t)
  :config
  (ace-pinyin-global-mode +1))

(with-eval-after-load 'meow
  (add-to-list 'meow-mode-state-list '(pdf-view-mode . motion))
  (add-to-list 'meow-mode-state-list '(dired-mode . motion))
  (add-to-list 'meow-mode-state-list '(org-agenda-mode . motion))
  (add-to-list 'meow-mode-state-list '(magit-status-mode . motion))
  (add-to-list 'meow-mode-state-list '(helpful-mode . motion))
  (add-to-list 'meow-mode-state-list '(help-mode . motion))
  
  (add-to-list 'meow-mode-state-list '(org-mode . normal))
  (meow-define-keys
   'normal
   '("TAB" . org-cycle))
  
  (with-eval-after-load 'ace-pinyin
    (meow-define-keys
     'normal
     '("v" . ace-pinyin-jump-char-2)
     '("V" . ace-pinyin-jump-char-in-line)))
  
  (with-eval-after-load 'org-roam
    (meow-leader-define-key
     '("n f" . org-roam-node-find)
     '("n i" . org-roam-node-insert)
     '("n c" . org-roam-capture)
     '("n l" . org-roam-buffer-toggle))))

(defun meow-debug-info ()
  "显示 Meow 的调试信息。"
  (interactive)
  (let ((buf (get-buffer-create "*Meow Debug*")))
    (with-current-buffer buf
      (erase-buffer)
      (insert (format "Meow 版本: %s\n" (if (fboundp 'meow-version)
                                         (meow-version)
                                       "未知")))
      (insert (format "当前状态: %s\n" meow--current-state))
      (insert (format "全局模式状态: %s\n" (if meow-global-mode "已启用" "未启用")))
      (insert "\n模式状态列表:\n")
      (dolist (mode-state meow-mode-state-list)
        (insert (format "  %s: %s\n" (car mode-state) (cdr mode-state))))
      (insert "\n键位映射:\n")
      (insert "  普通模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'normal meow--kbd-alist)))))
      (insert "  插入模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'insert meow--kbd-alist)))))
      (insert "  移动模式键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'motion meow--kbd-alist)))))
      (insert "  Leader键位数量: ")
      (insert (format "%d\n" (length (cdr (assoc 'leader meow--kbd-alist))))))
    (switch-to-buffer buf)))

(with-eval-after-load 'meow
  (meow-leader-define-key
   '("M-d" . meow-debug-info)))
